In [17]:
import pandas as pd
import numpy as np

In [7]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),#  ['b','d','e']랑 같음. 리스트에 문자를 넣으면 문자가 분해됨
                     index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]
frame
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [8]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [9]:
frame.iloc[0] # 유타라는 행을 선택했고 열 이름이 순서대로 온다.

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [10]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [21]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [12]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [13]:
frame + series2 #d와 f는 한쪽만 요소가 존재함

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [14]:
series3 = frame['d']#프레임에 d 참조
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [25]:
print(frame)
print(series3)
print(frame.sub(series3))

          b     e     f
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0
Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64
        Ohio  Oregon  Texas  Utah   b   e   f
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [16]:
frame.sub(series3, axis='index') #frame에서 series3를 행 방향으로 빼기

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [14]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -2.827364 -0.524654 -1.854394
Ohio   -1.020721  0.382727  0.256338
Texas   0.531974 -0.178064 -0.646948
Oregon -0.460040 -1.029673 -0.268417

In [16]:
np.abs(frame)#절대값

               b         d         e
Utah    2.827364  0.524654  1.854394
Ohio    1.020721  0.382727  0.256338
Texas   0.531974  0.178064  0.646948
Oregon  0.460040  1.029673  0.268417

In [ ]:
"""
map,apply 함수
"""
#두 함수는 비슷하다. 하지만 맵 함수가 더 많이 쓰인다.
# 맵함수는 시리즈에 적용 가능하다.
# 어플라이 함수는 시리즈와 데이터프레임에도 가능하다.
# 판다스에서는 시리즈단위로 연산하면 맵, 데이터프레임에 적용하면 어플라이를 주로 쓴다. 
# applymap과 같은 혼종도 존재한다. 데이터프레임에 대한 행/열 단위로 적용되는 특징이 있다.

In [18]:
# 맵함수 복습
a = [1.1,2.2,3.3]
# 모든 요소를 정수로 변환하고자 한다면
list(map(int, a)) #이와 같은 방법으로 적용을 시켰다.

[1, 2, 3]

In [ ]:
# 데이터프레임에서도 열 단위는 시리즈이다. 그래서 열 단위로 연산할 경우는 맵함수를 쓰는 것도 가능하다.

In [50]:
data = pd.DataFrame({
    'kor':[50,70,90,100],
    'eng':[80,90,100,100],
    'mat':[30,40,50,60]
},index=['1','2','3','4']
)
data

   kor  eng  mat
1   50   80   30
2   70   90   40
3   90  100   50
4  100  100   60

In [27]:
data/100

   kor  eng  mat
1  0.5  0.8  0.3
2  0.7  0.9  0.4
3  0.9  1.0  0.5
4  1.0  1.0  0.6

In [28]:
data['kor'] = data['kor']/100
data#이러한 연산은 맵연산으로 할 수 있다. kor자체는 1차원인 시리즈이기 때문이다.

   kor  eng  mat
1  0.5   80   30
2  0.7   90   40
3  0.9  100   50
4  1.0  100   60

In [29]:
data['eng']=data['eng'].map(lambda x : x/100)

In [30]:
data

   kor  eng  mat
1  0.5  0.8   30
2  0.7  0.9   40
3  0.9  1.0   50
4  1.0  1.0   60

In [31]:
data['mat']=data['mat'].map(lambda x : x/100)
data

   kor  eng  mat
1  0.5  0.8  0.3
2  0.7  0.9  0.4
3  0.9  1.0  0.5
4  1.0  1.0  0.6

In [32]:
data.map(lambda x : x*100)#애러가 나는 이유는 맵 함수를 데이터프레임으로 사용할 수 없기 때문이다.

AttributeError: 'DataFrame' object has no attribute 'map'

In [35]:
data=data*100

In [36]:
data

     kor    eng   mat
1   50.0   80.0  30.0
2   70.0   90.0  40.0
3   90.0  100.0  50.0
4  100.0  100.0  60.0

In [51]:
def summation(a):
    return a+10

In [52]:
data['map'] = data['mat'].map(summation) #맵 함수를 이용하여 함수연산을 시행한다.

In [53]:
data

   kor  eng  mat  map
1   50   80   30   40
2   70   90   40   50
3   90  100   50   60
4  100  100   60   70

In [41]:
#apply 함수 적용하는 법
#데이터프레임은 어플라이 함수를 적용해본다.
data.apply(lambda x:x/100)

   kor  eng  mat  map
1  0.5  0.8  0.3  0.4
2  0.7  0.9  0.4  0.5
3  0.9  1.0  0.5  0.6
4  1.0  1.0  0.6  0.7

In [42]:
data['kor'].apply(lambda x:x/100)#시리즈에서도 적용하는 것이 가능하다.

1    0.5
2    0.7
3    0.9
4    1.0
Name: kor, dtype: float64

In [45]:
# 맵은 어떤 경우에 사용하는가?
# key값을 이용하여 시리즈간에 매핑할 때 사용하는 것이 좋다.
# 예를 든다면 다음과 같다.
s1 = pd.Series(data = ['r','b','y'], index = ['가','나','다']) 
s1

가    r
나    b
다    y
dtype: object

In [47]:
s2=pd.Series(data=[10,20,30],index=['r','b','y'])
s2

r    10
b    20
y    30
dtype: int64

In [ ]:
# 여기서 원하는 것은 가,나,다 가 10,20,30과 연결하게 만들고 싶다면?
# 시리즈들끼리 매핑한다고 한다. 두 개를 연결하는 것이다.
# 이 작업은 맵으로 하면 쉽다.

In [48]:
s1.map(s2) #이게 끝이다.

가    10
나    20
다    30
dtype: int64

In [49]:
data.applymap(lambda x : x/100)

   kor  eng  mat  map
1  0.5  0.8  0.3  0.4
2  0.7  0.9  0.4  0.5
3  0.9  1.0  0.5  0.6
4  1.0  1.0  0.6  0.7

In [54]:
#문제
#한국어 "점"을 붙이고 싶다.
data

   kor  eng  mat  map
1   50   80   30   40
2   70   90   40   50
3   90  100   50   60
4  100  100   60   70

In [59]:
data.applymap(lambda x : str(x)+"점")

    kor   eng  mat  map
1   50점   80점  30점  40점
2   70점   90점  40점  50점
3   90점  100점  50점  60점
4  100점  100점  60점  70점

In [61]:
def score(s):
    return str(int(s))+"점"
data.applymap(score) #이러한 방법도 있다.

    kor   eng  mat  map
1   50점   80점  30점  40점
2   70점   90점  40점  50점
3   90점  100점  50점  60점
4  100점  100점  60점  70점

In [62]:
age = pd.Series([20,25,15,35,45])
age
#출력조건은 10대, 20대, 30대 이런식으로 출력되도록 해보자.

0    20
1    25
2    15
3    35
4    45
dtype: int64

In [67]:
age.map(lambda x : str(x//10*10)+"대")
#어플라이맵은 시리즈에서 사용할 수 없다. 오직 데이터프레임에서 사용할 수 있다.

0    20대
1    20대
2    10대
3    30대
4    40대
dtype: object

In [69]:
df = pd.DataFrame([[1,3,5],[4,5,6],[7,8,10]])
df

   0  1   2
0  1  3   5
1  4  5   6
2  7  8  10

In [72]:
#행 또는 열 단위로 최댓값과 최솟값의 차이를 출력하고자 한다.

0

In [73]:
max_values = df.max(axis=1)
min_values = df.min(axis=1)
max_values - min_values

0    4
1    2
2    3
dtype: int64

In [78]:
df.max() - df.min()

0    6
1    5
2    5
dtype: int64

In [79]:
df.max(axis =1) - df.min(axis =1) #min내부에 axis를 추가하여 행단위로도 확인 가능하다.

0    4
1    2
2    3
dtype: int64

In [80]:
def maxmin(d):
    return d.max()-d.min()
df.apply(maxmin)#열 단위 적용결과

0    6
1    5
2    5
dtype: int64

In [81]:
df.apply(maxmin,axis=0)#행 단위 적용결과
#즉 axis를 내부에 위치할 수 있다는 것도 참고하자.

0    6
1    5
2    5
dtype: int64

In [83]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [88]:
#여기서 행 단위나 열 단위로 최대값- 최소값을 출력하고 싶다.
print(frame.max(axis =1) - frame.min(axis =1))
print(frame.max() - frame.min())
# 이러한 식으로 가능하다.

Utah      2.0
Ohio      2.0
Texas     2.0
Oregon    2.0
dtype: float64
b    9.0
d    9.0
e    9.0
dtype: float64

In [90]:
# 더 세련되게 만들어보자
def myfunc(d):
    return d.max()-d.min()
frame.apply(myfunc) # 열 단위 연산이 수행되었다.

b    9.0
d    9.0
e    9.0
dtype: float64

In [92]:
frame.apply(myfunc,axis = 1) #행 단위로 연산이 수행되었다. frame.apply(myfunc,"columns")도 가능하다.

Utah      2.0
Ohio      2.0
Texas     2.0
Oregon    2.0
dtype: float64

In [97]:
def myfunc2(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [98]:
frame.apply(myfunc2)

       b     d     e
min  0.0   1.0   2.0
max  9.0  10.0  11.0

In [99]:
frame # 이걸 소수 둘째자리까지 전체 데이터를 바꾸고 싶다고 하면 어떻게 할까?

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [110]:
frame.applymap(lambda x : f"{x:.2f}")

           b      d      e
Utah    0.00   1.00   2.00
Ohio    3.00   4.00   5.00
Texas   6.00   7.00   8.00
Oregon  9.00  10.00  11.00

In [111]:
data=pd.DataFrame({
    'kor':["50점","70점","90점","100점"],
    'eng':["80점","90점","100점","100점"],
    'mat':["30점","40점","50점","60점"]    
},index=['1','2','3','4'])
data

    kor   eng  mat
1   50점   80점  30점
2   70점   90점  40점
3   90점  100점  50점
4  100점  100점  60점

In [117]:
#점이라고 하는 문자를 빼고 숫자만 추출을 하고 싶을경우 
data.applymap(lambda x : x[:-1]) #applymap은 각각의 요소에 대해 적용한다.
# 각각의 요소마다 적용된다. 람다함수의 적용대상은 전체요소

   kor  eng mat
1   50   80  30
2   70   90  40
3   90  100  50
4  100  100  60

In [118]:
data.apply(lambda x : x[:-1]) #apply로 하면 마지막 행이 삭제된다.
#apply는 각 시리즈별로 적용한다.
#즉 x에 열단위로 들어갔다 그래서 마지막 것이 슬라이싱 되어버렸다. 람다함수의 적용대상은 시리즈(열)
#만약 마지막것까지 참조하려면 저것은 마지막 인덱스 이름으로 대입해야 한다.

   kor   eng  mat
1  50점   80점  30점
2  70점   90점  40점
3  90점  100점  50점

In [119]:
df= pd.read_csv("titanic/train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [124]:
# 이름 앞에 있는 맨 앞의 3글자를 출력해보자
df["Name"].map(lambda x : x[:3])

0      Bra
1      Cum
2      Hei
3      Fut
4      All
      ...
886    Mon
887    Gra
888    Joh
889    Beh
890    Doo
Name: Name, Length: 891, dtype: object

In [125]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [126]:
obj.sort_index()#인덱스를 기준으로 정렬할 때 다음을 사용한다.

a    1
b    2
c    3
d    0
dtype: int32

In [127]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [128]:
frame.sort_index()#디폴트는 행 인덱스를 기준으로 정렬하도록 설정되어져있다.

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [129]:
frame.sort_index(axis = 1) #열 인데스를 기준으로 정렬하도록 만들었다.

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [130]:
frame.sort_index(axis = 1, ascending = False) #열 인데스를 기준으로 정렬하도록 만들었다. 어센딩을 폴스로 하여 내림차순도 가능하다.

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [131]:
obj

d    0
a    1
b    2
c    3
dtype: int32

In [132]:
obj.sort_values() #값에 따른 정렬

d    0
a    1
b    2
c    3
dtype: int32

In [133]:
obj.sort_values(ascending=False)#역순으로 정렬하기

c    3
b    2
a    1
d    0
dtype: int32

In [134]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [135]:
obj.sort_values(ascending=False) # 결측값은 항상 맨 아래로 간다.

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [138]:
obj.sort_values(na_position='first') # 결측값을 맨 위로 올린다.

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [139]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [140]:
frame.sort_values()#정렬을 시키는데 기준이 필요하다는 뜻이다.

TypeError: DataFrame.sort_values() missing 1 required positional argument: 'by'

In [141]:
frame.sort_values(by = "a") #a열 기준으로 정렬   frame.sort_values("a")도 가능하다.

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [142]:
frame.sort_values(by = "b") # b열 기준으로 정렬

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [143]:
frame.sort_values(by=["a","b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [144]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank() #점으로 표시된 곳은 등수라고 보면 된다.

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [145]:
obj.rank(method = "first") 
#특이한 것은 등수가 명확하게 매겨졌다.

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [146]:
obj.rank(method = "first",ascending =False) # 뒤에서 1등이 누구인가

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [147]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [148]:
frame.rank() # 열을 기준으로 등수가 매겨졌다. 수가 적을수록 등수가 높다.

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [153]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj # 중복이 많을 경우에

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [154]:
obj.index.is_unique#중복이 있다는 의미이다.

False

In [157]:
obj["a"]

a    0
a    1
dtype: int32

In [158]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a  1.324593  0.811813 -0.189504
a -0.436602  1.591946  1.490711
b  0.003759 -0.566279 -0.338761
b -1.358368  1.254246  0.270515
c  0.319741 -1.178308 -0.371506

In [159]:
df.loc["b"]

          0         1         2
b  0.003759 -0.566279 -0.338761
b -1.358368  1.254246  0.270515

In [160]:
df.loc['c']

0    0.319741
1   -1.178308
2   -0.371506
Name: c, dtype: float64

In [161]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [167]:
df.sum(axis = 'index')#데이터프레임 구성하는 구성요소의 합계요소이다. 열 단위로 행이 더해졌다. nan은 연산에서 제외되었다.

one    9.25
two   -5.80
dtype: float64

In [168]:
df.sum(axis=1) #행 단위로 열을 더했다. 재밌는 것은 nan은 연산에서 제외되었다.

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [170]:
df.sum(axis=0, skipna=False) #nan연산을 포함하면 이모양이 나온다.

one   NaN
two   NaN
dtype: float64

In [171]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [174]:
df.mean() #평균구하기.nan은 제외되었다. 나머지의 평균이다.

one    3.083333
two   -2.900000
dtype: float64

In [175]:
df.mean(axis = 1) # 열 방향으로 평균구하기. nan은 제외되었다.

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [176]:
df.idxmax() #열 기준 최대크기의 인덱스를 가진 행은 어디인가?

one    b
two    d
dtype: object

In [177]:
df.idxmax(axis = 1) #행 기준 최대크기의 인덱스를 가진 열 어디인가?

a    one
b    one
c    NaN
d    one
dtype: object

In [181]:
df.cumsum()#누적합. nan은 제외되었다.

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [182]:
df. describe() # 기술통계 : 갯수, 평균, 표준편차, 최소, 최대, 0사분위등이 적혀있다.

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [183]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj.describe()
# 전체 요소갯수
# 고유한 데이터
# 가장 큰 값
# 최빈수

count     16
unique     3
top        a
freq       8
dtype: object

In [184]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [186]:
# 피클 형식의 문서를 읽어보자.
price = pd.read_pickle("yahoo_price.pkl")
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [187]:
# 피클은 바이너리형태로 저장되어있는 파이썬 객체를 말한다.
# 바이너리형태의 피클을 읽어들이는 코드가 read_pickle이다.
volume = pd.read_pickle("yahoo_volume.pkl")
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [189]:
#가격차이를 백분율로 바꾸는 것은 퍼센트를 사용하면 된다.
returns = price.pct_change()
returns # 전날의 값과 비교해서 금액을 뺀 것이다.

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [ ]:
# 마이크로소프트사와 IBM사 간의 상관성을 조사하고 싶다면?
# returns는 변동률이다. 다음날의 주가에서 이전날의 주가를 뺀 결과값을 다음날 주가를 나눈 것이다. 즉 1주당 수익률이다.
# 양수는 전날보다 올랐다는 것이고. 음수는 전날보다 내렸다는 것이다.
# returns는 수익률 데이터이다. 마이크로소프트와 다른 회사간의 수익률의 상관관계를 알고싶은 것이다.
# 상관분석은 이럴때 사용한다.

In [207]:
returns["MSFT"].corr(returns["IBM"]) #상관계수가 제일 높다.
#corr은 상관계수를 구하는데 사용한다.

0.4997636114415114

In [208]:
returns["MSFT"].corr(returns["AAPL"])

0.38969458628057846

In [209]:
returns["MSFT"].corr(returns["GOOG"])

0.46591879490796656

In [210]:
returns["MSFT"].cov(returns["GOOG"]) # 공분산
# cov는 공분산이다.

0.00010817580798979645

In [214]:
returns.corrwith(returns["AAPL"])#이렇게 작성하면 IBM과 다른 기업의 상관계수가 모두 나온다.

AAPL    1.000000
GOOG    0.407919
IBM     0.386817
MSFT    0.389695
dtype: float64

In [215]:
!pip install -U finance-datareader #파이낸스데이터 리더를 불러오는 것이다. 
#한국, 미국 주식, 지수, 환율, 암호화폐등에 대한 정보를 제공하는 API이다

Collecting finance-datareader
  Downloading finance_datareader-0.9.50-py3-none-any.whl (19 kB)
Requirement already satisfied: pandas>=0.19.2 in c:\users\user\anaconda3\lib\site-packages (from finance-datareader) (1.5.3)
Requirement already satisfied: requests>=2.3.0 in c:\users\user\anaconda3\lib\site-packages (from finance-datareader) (2.31.0)
Requirement already satisfied: requests-file in c:\users\user\anaconda3\lib\site-packages (from finance-datareader) (1.5.1)
Requirement already satisfied: lxml in c:\users\user\anaconda3\lib\site-packages (from finance-datareader) (4.9.2)
Requirement already satisfied: tqdm in c:\users\user\anaconda3\lib\site-packages (from finance-datareader) (4.65.0)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\user\anaconda3\lib\site-packages (from pandas>=0.19.2->finance-datareader) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas>=0.19.2->finance-datareader) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\user\anaconda3\lib\site-packages (from pandas>=0.19.2->finance-datareader) (1.24.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.3.0->finance-datareader) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.3.0->finance-datareader) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.3.0->finance-datareader) (1.26.16)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.3.0->finance-datareader) (2023.7.22)
Requirement already satisfied: six in c:\users\user\anaconda3\lib\site-packages (from requests-file->finance-datareader) (1.16.0)
Requirement already satisfied: colorama in c:\users\user\anaconda3\lib\site-packages (from tqdm->finance-datareader) (0.4.6)
Installing collected packages: finance-datareader
Successfully installed finance-datareader-0.9.50
Note: you may need to restart the kernel to use updated packages.

In [218]:
import FinanceDataReader as fdr #금융데이터 리더

In [220]:
fdr.StockListing?? #만약 모르면 물음표 두개로 조건을 확인 가능하다.

In [223]:
df_krx = fdr.StockListing('KRX')
df_krx # 한국증시에 대해서 전부 가져온 것이다.

,Code,ISU_CD,Name,Market,Dept,Close,ChangeCode,Changes,ChagesRatio,Open,High,Low,Volume,Amount,Marcap,Stocks,MarketId
0,005930,KR7005930003,삼성전자,KOSPI,,70800,3,0,0.00,70800,71000,70400,9825488,693894274100,422660604540000,5969782550,STK
1,373220,KR7373220003,LG에너지솔루션,KOSPI,,500000,2,-8000,-1.57,513000,516000,499500,253325,127502504000,117000000000000,234000000,STK
2,000660,KR7000660001,SK하이닉스,KOSPI,,116900,1,1000,0.86,115400,117500,113900,2415718,279515417900,85103476468500,728002365,STK
3,207940,KR7207940008,삼성바이오로직스,KOSPI,,724000,2,-10000,-1.36,738000,738000,721000,29931,21774124000,51529976000000,71174000,STK
4,005935,KR7005931001,삼성전자우,KOSPI,,57000,1,200,0.35,57500,57500,56800,710096,40555783900,46904541900000,822886700,STK
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2747,245450,KR7245450002,씨앤에스링크,KONEX,일반기업부,1650,2,-48,-2.83,1699,1699,1579,849,1341062,2606934000,1579960,KNX
2748,288490,KR7288490006,나라소프트,KONEX,일반기업부,54,2,-2,-3.57,56,56,51,75996,4057847,2336418270,43267005,KNX
2749,308700,KR7308700004,테크엔,KONEX,일반기업부,339,1,40,13.38,256,342,256,746,191314,1356000000,4000000,KNX
2750,322190,KR7322190000,베른,KONEX,일반기업부,122,2,-9,-6.87,131,131,112,11801,1325343,1088874034,8925197,KNX
2751,242350,KR7242350007,피엔아이컴퍼니,KONEX,일반기업부,54,2,-29,-34.94,81,81,52,513535,31389413,257932080,4776520,KNX

In [224]:
df_spx = fdr.StockListing('S&P500')
df_spx

,Symbol,Name,Sector,Industry
0,MMM,3M,Industrials,Industrial Conglomerates
1,AOS,A. O. Smith,Industrials,Building Products
2,ABT,Abbott,Health Care,Health Care Equipment
3,ABBV,AbbVie,Health Care,Pharmaceuticals
4,ACN,Accenture,Information Technology,IT Consulting & Other Services
...,...,...,...,...
498,YUM,Yum! Brands,Consumer Discretionary,Restaurants
499,ZBRA,Zebra Technologies,Information Technology,Electronic Equipment & Instruments
500,ZBH,Zimmer Biomet,Health Care,Health Care Equipment
501,ZION,Zions Bancorporation,Financials,Regional Banks
502,ZTS,Zoetis,Health Care,Pharmaceuticals

In [225]:
df_krx

,Code,ISU_CD,Name,Market,Dept,Close,ChangeCode,Changes,ChagesRatio,Open,High,Low,Volume,Amount,Marcap,Stocks,MarketId
0,005930,KR7005930003,삼성전자,KOSPI,,70800,3,0,0.00,70800,71000,70400,9825488,693894274100,422660604540000,5969782550,STK
1,373220,KR7373220003,LG에너지솔루션,KOSPI,,500000,2,-8000,-1.57,513000,516000,499500,253325,127502504000,117000000000000,234000000,STK
2,000660,KR7000660001,SK하이닉스,KOSPI,,116900,1,1000,0.86,115400,117500,113900,2415718,279515417900,85103476468500,728002365,STK
3,207940,KR7207940008,삼성바이오로직스,KOSPI,,724000,2,-10000,-1.36,738000,738000,721000,29931,21774124000,51529976000000,71174000,STK
4,005935,KR7005931001,삼성전자우,KOSPI,,57000,1,200,0.35,57500,57500,56800,710096,40555783900,46904541900000,822886700,STK
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2747,245450,KR7245450002,씨앤에스링크,KONEX,일반기업부,1650,2,-48,-2.83,1699,1699,1579,849,1341062,2606934000,1579960,KNX
2748,288490,KR7288490006,나라소프트,KONEX,일반기업부,54,2,-2,-3.57,56,56,51,75996,4057847,2336418270,43267005,KNX
2749,308700,KR7308700004,테크엔,KONEX,일반기업부,339,1,40,13.38,256,342,256,746,191314,1356000000,4000000,KNX
2750,322190,KR7322190000,베른,KONEX,일반기업부,122,2,-9,-6.87,131,131,112,11801,1325343,1088874034,8925197,KNX
2751,242350,KR7242350007,피엔아이컴퍼니,KONEX,일반기업부,54,2,-29,-34.94,81,81,52,513535,31389413,257932080,4776520,KNX

In [226]:
fdr.DataReader("005930",'2023') #삼성전자 2023년 주가데이터 출력결과

             Open   High    Low  Close    Volume    Change
Date
2023-01-02  55500  56100  55200  55500  10031448  0.003617
2023-01-03  55400  56000  54500  55400  13547030 -0.001802
2023-01-04  55700  58000  55600  57800  20188071  0.043321
2023-01-05  58200  58800  57600  58200  15682826  0.006920
2023-01-06  58300  59400  57900  59000  17334989  0.013746
...           ...    ...    ...    ...       ...       ...
2023-09-06  70700  70800  69700  70000  11414620 -0.009901
2023-09-07  70000  70600  69600  70400  13741241  0.005714
2023-09-08  70200  70300  69600  70300  10688118 -0.001420
2023-09-11  70400  70800  70000  70800  11785462  0.007112
2023-09-12  70800  71000  70400  70600  10300631 -0.002825

[174 rows x 6 columns]

In [228]:
fdr.DataReader("005930",'2015-01-01', '2023-09-12') #삼성전자 특정기간 주가데이터 출력결과

             Open   High    Low  Close    Volume    Change
Date
2015-01-02  26799  26799  26540  26600    175499  0.002261
2015-01-05  26720  26720  26260  26660    202790  0.002256
2015-01-06  26300  26340  25760  25900    304710 -0.028507
2015-01-07  25880  26220  25640  26140    286455  0.009266
2015-01-08  26780  26780  26199  26280    289552  0.005356
...           ...    ...    ...    ...       ...       ...
2023-09-06  70700  70800  69700  70000  11414620 -0.009901
2023-09-07  70000  70600  69600  70400  13741241  0.005714
2023-09-08  70200  70300  69600  70300  10688118 -0.001420
2023-09-11  70400  70800  70000  70800  11785462  0.007112
2023-09-12  70800  71000  70400  70400  10488190 -0.005650

[2143 rows x 6 columns]

In [229]:
fdr.DataReader("AAPL",'2015-01-01', '2023-09-12') #애플 특정기간 주가데이터 출력결과

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2015-01-02,27.847500,27.860001,26.837500,27.332500,24.498684,212818400
2015-01-05,27.072500,27.162500,26.352501,26.562500,23.808508,257142000
2015-01-06,26.635000,26.857500,26.157499,26.565001,23.810755,263188400
2015-01-07,26.799999,27.049999,26.674999,26.937500,24.144634,160423600
2015-01-08,27.307501,28.037500,27.174999,27.972500,25.072332,237458000
...,...,...,...,...,...,...
2023-09-05,188.279999,189.979996,187.610001,189.699997,189.699997,45280000
2023-09-06,188.399994,188.850006,181.470001,182.910004,182.910004,81755800
2023-09-07,175.179993,178.210007,173.539993,177.559998,177.559998,112488800
2023-09-08,178.350006,180.240005,177.789993,178.179993,178.179993,65551300
2023-09-11,180.070007,180.300003,177.339996,179.360001,179.360001,58863800

In [234]:
df = fdr.DataReader("KS11","2003") #코스피지수
df

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2003-01-02,633.030029,637.099976,623.750000,635.169983,635.169983,742900.0
2003-01-03,651.590027,662.400024,649.619995,661.099976,661.099976,1005800.0
2003-01-06,665.099976,667.710022,657.609985,666.710022,666.710022,721800.0
2003-01-07,679.000000,679.299988,652.140015,652.200012,652.200012,690100.0
2003-01-08,655.969971,660.390015,650.929993,651.719971,651.719971,604900.0
...,...,...,...,...,...,...
2023-09-06,2577.409912,2585.979980,2560.090088,2563.340088,2563.340088,421500.0
2023-09-07,2554.870117,2562.419922,2539.239990,2548.260010,2548.260010,376600.0
2023-09-08,2546.070068,2550.959961,2530.050049,2547.679932,2547.679932,395800.0
2023-09-11,2549.879883,2556.889893,2540.439941,2556.879883,2556.879883,410300.0
2023-09-12,2566.419922,2568.550049,2539.169922,2541.600098,2541.600098,311683.0

In [237]:
df2 = fdr.DataReader("USD/KRW","1995") #달러환율
df2

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2003-12-01,1197.300049,1203.500000,1195.000000,1198.400024,1198.400024,0.0
2003-12-02,1198.099976,1198.500000,1186.199951,1195.000000,1195.000000,0.0
2003-12-03,1195.000000,1198.400024,1192.500000,1192.500000,1192.500000,0.0
2003-12-04,1192.599976,1197.900024,1174.800049,1190.099976,1190.099976,0.0
2003-12-05,1189.400024,1193.800049,1178.599976,1184.699951,1184.699951,0.0
...,...,...,...,...,...,...
2023-09-06,1331.729980,1337.560059,1328.189941,1331.729980,1331.729980,0.0
2023-09-07,1333.459961,1338.300049,1330.250000,1333.459961,1333.459961,0.0
2023-09-08,1334.020020,1335.530029,1331.260010,1334.020020,1334.020020,0.0
2023-09-11,1335.319946,1335.319946,1326.030029,1335.319946,1335.319946,0.0
2023-09-12,1323.920044,1328.020020,1322.619995,1326.829956,1326.829956,0.0

In [238]:
df3 = fdr.DataReader("BTC/USD","2010") #비트코인
df3

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,21056800
2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,34483200
2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,37919700
2014-09-20,394.673004,423.295990,389.882996,408.903992,408.903992,36863600
2014-09-21,408.084991,412.425995,393.181000,398.821014,398.821014,26580100
...,...,...,...,...,...,...
2023-09-08,26245.208984,26414.005859,25677.480469,25905.654297,25905.654297,10817356400
2023-09-09,25905.425781,25921.976563,25810.494141,25895.677734,25895.677734,5481314132
2023-09-10,25895.210938,25978.130859,25640.261719,25832.226563,25832.226563,7899553047
2023-09-11,25831.714844,25883.947266,24930.296875,25162.654297,25162.654297,14600006467
2023-09-12,25154.376953,25923.285156,25134.943359,25802.328125,25802.328125,17620869120

In [ ]:
#모든 자료가 데이터프레임이다. 그렇기에 데이터프레임을 잘 다뤄야 한다.

In [240]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
obj #데이터에 종류가 몇가지인지 실행하고자 한다.

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [242]:
uniques = obj.unique()
uniques#고유 데이터를 볼 수 있다

array(['c', 'a', 'd', 'b'], dtype=object)

In [243]:
obj.value_counts()#데이터 종류별로 건수를 확인할 수 있다.

c    3
a    3
b    2
d    1
dtype: int64

In [246]:
pd.value_counts(obj.to_numpy(), sort = True) # 위와 결과가 같다.

c    3
a    3
b    2
d    1
dtype: int64

In [247]:
pd.value_counts(obj.to_numpy(), sort = False) # 정렬이 되지 않았다.

c    3
a    3
d    1
b    2
dtype: int64

In [248]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [251]:
obj.isin(["f", "b"]) #안에 있는지 검색하기.

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7    False
8    False
dtype: bool

In [253]:
obj[obj.isin(["f", "b"])] #불린참조

5    b
6    b
dtype: object

In [254]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data #Qu1을 추출하면서 시작해보자.

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [255]:
data['Qu1']

0    1
1    3
2    4
3    3
4    4
Name: Qu1, dtype: int64

In [258]:
data['Qu1'].value_counts() # 각 요소의 갯수들이 출력되었다.

3    2
4    2
1    1
Name: Qu1, dtype: int64

In [ ]:
data['Qu1'].value_counts().sort_index() #인덱스 기준으로 출력되었다.

In [259]:
import numpy as np #복습시간

In [260]:
data = [1,2,3] #리스트를 배열로 바꾸기
np.array(data)

array([1, 2, 3])

In [261]:
np.array(data).shape #1차원 3개

(3,)

In [266]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [267]:
df['현재가']

종목코드
037730    1510
036360    1790
005760    1185
Name: 현재가, dtype: int64

In [268]:
df[['현재가']] #대괄호 두개를 쓰면 데이터프레임이 된다.

         현재가
종목코드
037730  1510
036360  1790
005760  1185

In [273]:
df.loc['037730']
df.iloc[0] # 특정 코드를 참조하는 방법이다.

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [275]:
df.iloc[[0,2]] # 두 종목을 추출하기 위해서는 대괄호를 두 번 씌운다. 
df.loc[['037730','005760']]

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005760  ACTS  1185  1.28

In [277]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [ ]:
위 데이터프레임에서 iloc 속성을 사용하여 첫번째, 두번째 행을 슬라이싱하세요.
위 데이터프레임에서 loc 속성을 사용하여 첫번째, 두번째 행을 슬라이싱하세요.
위 데이터프레임에서 iloc 속성을 사용하여 첫 번째 컬럼을 인덱싱하세요.
위 데이터프레임에서 loc 속성을 사용하여 첫 번째 컬럼을 인덱싱하세요.
위 데이터프레임에서 loc 속성을 사용하여 '037730' 종목의 '종목명', '현재가' 컬럼을 선택하세요.
위 데이터프레임에서 iloc 속성을 사용하여 '037730' 종목의 '종목명', '현재가' 컬럼을 선택하세요.

In [279]:
#1
df.iloc[:2]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [280]:
#2
df.loc[:'036360']

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [314]:
df.iloc[axis='1']

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (1444866583.py, line 1)

In [298]:
#5
df.loc['037730']

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [302]:
df.iloc[0:2]
df.loc['037730':'036360']
df.iloc[:,0] #이걸 생각 못하다니. 나도 멍청해졌어.
df.loc[:,'종목명'] #이렇게 쉬운 방법이 존재하잖아.
df.loc['037730','종목명':'현재가']
df.iloc[0,0:2]

#이번에 나는 창의적이지 못했다. 
# 특히 3번문제.. 이건 오답노트로 정리하자.

SyntaxError: invalid syntax (1044912488.py, line 1)

In [ ]:
df.iloc[[0,1]]
df.loc[['037730','036360']]
df.iloc[:, 0] #안돠면 이렇게 띄어서 해도 상관은 없었어...
df.loc[:, '종목명']
df.loc['037730'][:2]
df.iloc[0][:2]